{"keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 3, 137], "mask_value": -1}}, {"class_name": "LSTM", "config": {"unroll": false, "bias_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "batch_input_shape": [null, 3, 137], "recurrent_regularizer": null, "trainable": true, "stateful": false, "unit_forget_bias": true, "return_state": false, "kernel_constraint": null, "dtype": "float32", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "go_backwards": false, "activity_regularizer": null, "name": "lstm_1", "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "units": 32, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "implementation": 0, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "batch_input_shape": [null, 32], "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 65, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}], "backend": "tensorflow"}